Конфигурация/Documents/Акцепт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Акцепт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АкцептованиеОпераций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАкцепта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАкцептов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеКредитногоИнструмента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСВалютой</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыАкцептов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыАкцептов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеКомиссииБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБрокерскойКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТорговойКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСБрокерскогоСчетаНаРасчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласиеНаОферту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаВыводАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНОСрочный30Дней4ПроцентаУКПИ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ДоговорыБрокерскогоОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорыБрокерскогоОбслуживания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВладельцаДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Documents/Акцепт/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтотОбъект);
	    	
	ПриЧтенииСозданииНаСервере();
			
	УстановитьСвязиПараметровВыбораОбъекта();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда 
		
		КонтрагентыИСчетаДУ = ПолучитьДанныеОбИсполнителях();
		
		Если КонтрагентыИСчетаДУ <> Неопределено Тогда 	
			
			Элементы.Контрагент.РежимВыбораИзСписка = Ложь;
			Элементы.СчетДоверительногоУправления.РежимВыбораИзСписка = Ложь;
			
			Элементы.СчетДоверительногоУправления.СписокВыбора.ЗагрузитьЗначения(КонтрагентыИСчетаДУ.МассивСчетовДУ);		
			Элементы.Контрагент.СписокВыбора.ЗагрузитьЗначения(КонтрагентыИСчетаДУ.МассивКонтрагентов);
			
			// Если в каждом массиве по одному элементу, установим значения полей
			Если КонтрагентыИСчетаДУ.МассивСчетовДУ.Количество() = 1 Тогда
				Объект.СчетДоверительногоУправления = КонтрагентыИСчетаДУ.МассивСчетовДУ[0];
			КонецЕсли;
			
			Если КонтрагентыИСчетаДУ.МассивКонтрагентов.Количество() = 1 Тогда
				Объект.Контрагент = КонтрагентыИСчетаДУ.МассивКонтрагентов[0];
			КонецЕсли;
						
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(Объект.Акцептант) Тогда
			ОбновитьАкцептанта();
		КонецЕсли;
					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Объект) Тогда
		
		Если ТипЗнч(Объект.Объект) = Тип("ДокументСсылка.МНО")
			Или ТипЗнч(Объект.Объект) = Тип("ДокументСсылка.Распоряжение") 
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Объект, "ВидОперации") = Перечисления.ВидыОперацийБэкОфиса.МНО Тогда
			Объект.ВидАкцепта = Перечисления.ВидыАкцептов.МНО;
		ИначеЕсли ТипЗнч(Объект.Объект) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
			Объект.ВидАкцепта = Перечисления.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный;			
		КонецЕсли;

	КонецЕсли;
	
	ЭтаФорма.СрочныйАкцепт = ЗначениеЗаполнено(Объект.Срок);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступныеТипыРеквизитов();
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Справочник Договоры пока не используется. В перспективе должен остаться только он
	ТипОснования = ТипЗнч(Объект.Объект);
	Если ТипОснования = Тип("СправочникСсылка.Договоры") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Акцептование для справочника 'Договоры' не предусмотрено!",,,, Отказ);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Оплата") Тогда
		ПроверитьОснованиеОплатаНаСервере(Отказ);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	Если ЗначениеЗаполнено(ТекущийОбъект.Объект) И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И ОснованиеКороткогоАкцепта(ТипЗнч(ТекущийОбъект.Объект)) Тогда 		
		
		Если (ТипЗнч(ТекущийОбъект.Объект) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств")) Тогда
			Возврат;
		ИначеЕсли (ТипЗнч(ТекущийОбъект.Объект) = Тип("ДокументСсылка.СтрокаБанковскойВыписки")) Тогда
			ОбъектДокумента = РеквизитФормыВЗначение("Объект");
			ДокументыДвиженияДенег = ОбъектДокумента.ПолучитьДокументыДвиженияДенегПоВыписке(ТекущийОбъект.Объект);
			Для каждого ДокументДвиженияДенег Из ДокументыДвиженияДенег Цикл
				РаботаСДокументами.ИзменитьВремяДокументаСУчетомАкцептования(ДокументДвиженияДенег, ТекущийОбъект.Дата);
			КонецЦикла;
		Иначе
			РаботаСДокументами.ИзменитьВремяДокументаСУчетомАкцептования(ТекущийОбъект.Объект, ТекущийОбъект.Дата);	 
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Объект.Объект);	
	ПараметрыОповещения = Новый Структура("ОбъектАкцептования", Объект.Объект);
	
	Оповестить("ЗаписьАкцепта", ПараметрыОповещения, Объект.Ссылка);
		
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	ОбновитьДоступныеТипыРеквизитов();
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	КонтактныеЛицаАкцептанта = ПолучитьКонтактныеЛицаАкцептанта(Объект.Акцептант);
	Элементы.Представитель.СписокВыбора.ЗагрузитьЗначения(КонтактныеЛицаАкцептанта);

	ВыбЭлемент		 = Элементы.Представитель.СписокВыбора.НайтиПоЗначению(Объект.Представитель);
	ВыбПредставитель = Элементы.Представитель.СписокВыбора.ВыбратьЭлемент("Выберите контактное лицо акцептанта", ВыбЭлемент);
	
	Если ВыбПредставитель <> Неопределено Тогда
		Объект.Представитель = ВыбПредставитель;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ПолучитьКонтактныеЛицаАкцептанта(Акцептант)
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.КонтактноеЛицо
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Объект = &Акцептант";
		
	Запрос.УстановитьПараметр("Акцептант", Акцептант);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо");
	
КонецФункции

&НаКлиенте
Процедура ВидАкцептаПриИзменении(Элемент)
	
	ОбновитьДоступныеТипыРеквизитов(); 			 
	НастроитьВидимостьИДоступность();

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ОбновитьАкцептанта();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяАкцептаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка)
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере(); 	
	ОбновитьДоступныеТипыРеквизитов();

КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	УстановитьСвязиПараметровВыбораОбъекта();
	
	Если УстановитьДоговорБрокерскогоОбслуживания() Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Банки") И ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		// Проверяем банк у банковского счета
		Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Объект, "Банк");
		Если Объект.Контрагент <> Банк Тогда
			Объект.Объект = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.БрокерскиеКомпании") И ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания") Тогда
		// Проверяем владельца договора
		ЮрЛицоДоговора 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Объект, "Контрагент");
		ЮрЛицоКонтрагента 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ЮрФизЛицо");
		Если ЮрЛицоДоговора <> ЮрЛицоКонтрагента Тогда
			Объект.Объект = Справочники.ДоговорыБрокерскогоОбслуживания.ПустаяСсылка();
		КонецЕсли;
	Иначе
		// Очищаем объект акцептования
		Объект.Объект = "";
	КонецЕсли;		
			
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.Контрагент.Видимость = Ложь Или Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать счет доверительного управления", , "СчетДоверительногоУправления");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Банки") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбратьИсполнителяПоДенежнымСредствам();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Банки") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбратьИсполнителяПоДенежнымСредствам();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СрочныйАкцептПриИзменении(Элемент)
		
	Если Не ЭтаФорма.СрочныйАкцепт Тогда
		Объект.Срок = Неопределено;	
	КонецЕсли;
	
	НастроитьВидимостьИДоступность();
		
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиенте
Процедура ОбновитьДоступныеТипыРеквизитов()
	
	// Назначим типы для выбора у полей Контрагент и Объект
	ТипыКонтрагента = Новый Массив;
	ТипыОбъекта = Новый Массив;
	ВыдыАкцепта = Новый Массив;
	ПустаяСсылкаКонтрагента = Неопределено; 
	
	ОснованиеКороткогоАкцепта = ОснованиеКороткогоАкцепта(ТипЗнч(Объект.Объект));
	
#Область Вид_Акцепта	
	Если Не ЗначениеЗаполнено(Объект.Объект) Тогда
		
		// Список видов акцепта по умолчанию
		ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СМО"));
		ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНО"));
		ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеКомиссииБанка"));
		ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный"));		
		ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеБрокерскойКомиссии"));         		
		ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеТорговойКомиссии"));
				
	Иначе	
		
		ТипОснования = ТипЗнч(Объект.Объект);
			
		Если Не ОснованиеКороткогоАкцепта Тогда
						
			Если ТипОснования = Тип("СправочникСсылка.БанковскиеСчета") Тогда
				
				ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеКомиссииБанка"));
				ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СМО"));
				ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНО"));
				ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНОСрочный30Дней4ПроцентаУКПИ"));
				
				ТипыКонтрагента.Добавить(Тип("СправочникСсылка.Банки"));
				
			ИначеЕсли ТипОснования = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания") Тогда
				
				ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеБрокерскойКомиссии"));
				ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеТорговойКомиссии"));
				ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный"));
				
			КонецЕсли;
		
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
			
			ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный"));
			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") 
				Или ТипОснования = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг") Тогда
				
			ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПоручениеНаВыводАктивов"));
			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.МНО")
			Или ТипОснования = Тип("ДокументСсылка.Распоряжение") 
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Объект, "ВидОперации") = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.МНО") Тогда
				
			ВыдыАкцепта.Добавить(ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНО"));
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Элементы.ВидАкцепта.СписокВыбора.ЗагрузитьЗначения(ВыдыАкцепта);
	
	Если ЗначениеЗаполнено(Объект.ВидАкцепта) И ВыдыАкцепта.Найти(Объект.ВидАкцепта) = Неопределено Тогда
		Объект.ВидАкцепта = Неопределено;		
	КонецЕсли;
	
#КонецОбласти
	
	Если Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеКомиссииБанка")
		Или Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СМО")
		Или Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНОСрочный30Дней4ПроцентаУКПИ") Тогда
		
		ТипыОбъекта.Добавить(Тип("СправочникСсылка.БанковскиеСчета"));
		
		ТипыКонтрагента.Добавить(Тип("СправочникСсылка.Банки"));	
		ПустаяСсылкаКонтрагента = ПредопределенноеЗначение("Справочник.Банки.ПустаяСсылка");
		
	ИначеЕсли Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеТорговойКомиссии")
		Или Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.СписаниеБрокерскойКомиссии") Тогда
		
		ТипыОбъекта.Добавить(Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания"));
		
		ТипыКонтрагента.Добавить(Тип("СправочникСсылка.БрокерскиеКомпании"));	
		ПустаяСсылкаКонтрагента = ПредопределенноеЗначение("Справочник.БрокерскиеКомпании.ПустаяСсылка");
		// Тип "Договоры" пока не используется
		//МассивТиповДляВыбораОбъекта.Добавить(Тип("СправочникСсылка.Договоры"));
	ИначеЕсли Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный") Тогда
		
			ТипыОбъекта.Добавить(Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания"));
			ТипыОбъекта.Добавить(Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств"));

			ТипыКонтрагента.Добавить(Тип("СправочникСсылка.БрокерскиеКомпании"));
			ПустаяСсылкаКонтрагента = ПредопределенноеЗначение("Справочник.БрокерскиеКомпании.ПустаяСсылка");
		
	ИначеЕсли Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПоручениеНаВыводАктивов") Тогда
		
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств"));
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг")); 
		
	ИначеЕсли Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНО") Тогда
		
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.МНО"));
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.Распоряжение"));
		ТипыОбъекта.Добавить(Тип("СправочникСсылка.БанковскиеСчета")); 
		
		ТипыКонтрагента.Добавить(Тип("СправочникСсылка.Банки"));
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ВидАкцепта) Тогда
		
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента"));
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.СтрокаБанковскойВыписки"));
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.СделкаСВалютой"));
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.Сделка"));	
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.Оплата"));
		ТипыОбъекта.Добавить(Тип("ДокументСсылка.МНО"));
		ТипыОбъекта.Добавить(Тип("СправочникСсылка.БанковскиеСчета"));
		
	КонецЕсли;
		
	Элементы.Контрагент.ОграничениеТипа = Новый ОписаниеТипов(ТипыКонтрагента);
	Элементы.Объект.ОграничениеТипа 	= Новый ОписаниеТипов(ТипыОбъекта);
	
	Если Объект.Объект <> Неопределено Тогда
		
		Если ТипыОбъекта.Найти(ТипЗнч(Объект.Объект)) = Неопределено Тогда
			Объект.Объект = Неопределено;	
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Если ТипыКонтрагента.Найти(ТипЗнч(Объект.Контрагент)) = Неопределено Или ОснованиеКороткогоАкцепта Тогда
			Объект.Контрагент = Неопределено;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(Объект.Контрагент)) И ТипыКонтрагента.Количество() = 1 Тогда
		Объект.Контрагент = ПустаяСсылкаКонтрагента;
	КонецЕсли;
	
	Если Не (Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНОСрочный30Дней4ПроцентаУКПИ")
				Или Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНО")
				Или Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный")) Тогда
				
		ЭтаФорма.СрочныйАкцепт = Ложь;
		
		Если ЗначениеЗаполнено(Объект.Срок) Тогда
			Объект.Срок = Неопределено;		
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура НастроитьВидимостьИДоступность()
	
	ТипОбъекта = ТипЗнч(Объект.Объект); 
	ОснованиеДляКороткогоАкцепта = ОснованиеКороткогоАкцепта(ТипОбъекта);
	
	Элементы.Контрагент.Видимость = ЗначениеЗаполнено(Объект.Объект) И Не ОснованиеДляКороткогоАкцепта;
		
	Если ТипЗнч(Объект.Объект) = ТипЗнч(Неопределено) Тогда
		
		ДоступенСрочныйАкцепт = 
			(Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный")
				Или Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНОСрочный30Дней4ПроцентаУКПИ")
				Или Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНО"));
				
	Иначе
		
		ДоступенСрочныйАкцепт = 
			(Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.ПереводСБрокерскогоСчетаНаРасчетный")
				И (ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Договоры") 
					Или ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания"))
			Или ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.БанковскиеСчета")
				И (Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНОСрочный30Дней4ПроцентаУКПИ")
				Или	Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНО")));
				
	КонецЕсли;
				
	Элементы.ГруппаСрочныйАкцепт.Видимость = ДоступенСрочныйАкцепт;		
	Элементы.СрочныйАкцепт.Доступность = ДоступенСрочныйАкцепт;
	
	Элементы.Срок.Доступность = Этаформа.СрочныйАкцепт;
	
	СвязиСкрываемыхПолей = Новый Структура("ГруппаСрочныйАкцепт", РаботаСКоллекциями.ЗначенияВМассив("Объект.Срок", "СрочныйАкцепт"));		                                 
	РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(ЭтаФорма, СвязиСкрываемыхПолей);	
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОснованиеКороткогоАкцепта(ТипОснования)
		
	ЭтоКороткийАкцепт = (ТипОснования = Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента") 
				ИЛИ ТипОснования = Тип("ДокументСсылка.СтрокаБанковскойВыписки") 
				ИЛИ ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") 
				ИЛИ ТипОснования = Тип("ДокументСсылка.МНО")
				ИЛИ ТипОснования = Тип("ДокументСсылка.Распоряжение")
				ИЛИ ТипОснования = Тип("ДокументСсылка.СделкаСВалютой") 
				ИЛИ ТипОснования = Тип("ДокументСсылка.Сделка")
				ИЛИ ТипОснования = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств")
				ИЛИ ТипОснования = Тип("ДокументСсылка.Оплата")
				ИЛИ ТипОснования = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств")
				ИЛИ ТипОснования = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг"));

	Возврат ЭтоКороткийАкцепт;
	
КонецФункции			

&НаСервере
Процедура ОбновитьАкцептанта()
	
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		СпецДеп = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "СпециализированныйДепозитарий");
		Объект.Акцептант = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпецДеп, "ЮрФизЛицо");
	КонецЕсли;
	
КонецПроцедуры // ОбновитьАкцептанта()

&НаСервереБезКонтекста
Функция ПолучитьДокументыДвиженияДенегПоВыписке(Операция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеестрПлатежей.ДвижениеДенежныхСредств
	|ИЗ
	|	РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
	|ГДЕ
	|	РеестрПлатежей.СтрокаБанковскойВыписки = &СтрокаБанковскойВыписки";
	
	Запрос.УстановитьПараметр("СтрокаБанковскойВыписки", Операция);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДвижениеДенежныхСредств");
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеОбИсполнителях()
		
	// Справочник Договоры пока не используется. В перспективе должен остаться только он	
	Если Не ЗначениеЗаполнено(Объект.Объект) Или ОснованиеКороткогоАкцепта(ТипЗнч(Объект.Объект))
		Или ТипЗнч(Объект.Объект) = Тип("СправочникСсылка.Договоры") Тогда 	
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область Текст_Запроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк КАК Контрагент,
		|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ИсходнаяТаблица
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И ТИПЗНАЧЕНИЯ(&Основание) = ТИП(Справочник.БанковскиеСчета)
		|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И ТИПЗНАЧЕНИЯ(&Основание) В (ТИП(Справочник.ДоговорыБрокерскогоОбслуживания), ТИП(Справочник.Договоры))
		|				И ДоговорБрокерскогоОбслуживания = &Основание) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ИсходнаяТаблица.Контрагент КАК Ссылка
		|ПОМЕСТИТЬ _Контрагенты
		|ИЗ
		|	_ИсходнаяТаблица КАК _ИсходнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ИсходнаяТаблица.СчетДоверительногоУправления КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	_ИсходнаяТаблица КАК _ИсходнаяТаблица";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Дата", ?(Объект.Дата = '00010101000000', ТекущаяДата(), Объект.Дата));
	Запрос.УстановитьПараметр("Основание", Объект.Объект);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Запрос.Выполнить(); 
	
	Результат = Новый Структура();

	Результат.Вставить("МассивКонтрагентов", Запрос.МенеджерВременныхТаблиц.Таблицы["_Контрагенты"].ПолучитьДанные().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Результат.Вставить("МассивСчетовДУ", Запрос.МенеджерВременныхТаблиц.Таблицы["_СчетаДУ"].ПолучитьДанные().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ПроверитьОснованиеОплатаНаСервере(Отказ)
	
	РеквизитыОплаты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Объект, "Брокер, ВидДвижения, МестоХранения");
	
	// Оплата должна быть расходная, через брокера, по внебиржевому рынку
	Если Не (РеквизитыОплаты.Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка()
			И РеквизитыОплаты.ВидДвижения = Перечисления.ВидыДвижений.Расход 
			И РеквизитыОплаты.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок) Тогда
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Акцепт предусмотрен только для внебиржевой оплаты через брокера",,,, Отказ);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораОбъекта()
	
	МассивСвязей = Новый Массив();
	
	//Отбор по организации и счету доверительного управления - по умолчанию
	НовыйОтбор = Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация", РежимИзмененияСвязанногоЗначения.Очищать);	
	МассивСвязей.Добавить(НовыйОтбор);
	
	НовыйОтбор = Новый СвязьПараметраВыбора("Отбор.СчетДоверительногоУправления", "Объект.СчетДоверительногоУправления", РежимИзмененияСвязанногоЗначения.Очищать);	
	МассивСвязей.Добавить(НовыйОтбор); 
	
	Если ЗначениеЗаполнено(Объект.Контрагент) И ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Банки") Тогда
		
		НовыйОтбор = Новый СвязьПараметраВыбора("Отбор.Банк", "Объект.Контрагент", РежимИзмененияСвязанногоЗначения.Очищать);	
		МассивСвязей.Добавить(НовыйОтбор);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Контрагент) И ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.БрокерскиеКомпании") Тогда
		
		ЮрФизЛицоКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ЮрФизЛицо");
		НовыйОтбор = Новый СвязьПараметраВыбора("Отбор.Контрагент", "ЮрФизЛицоКонтрагента", РежимИзмененияСвязанногоЗначения.Очищать);	
		МассивСвязей.Добавить(НовыйОтбор); 
			
	КонецЕсли;
	
	ФиксМассив = Новый ФиксированныйМассив(МассивСвязей);		
	Элементы.Объект.СвязиПараметровВыбора = ФиксМассив;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИсполнителяПоДенежнымСредствам()
		
	ПараметрыФормыВыбора = Новый Структура("ВозвращатьВсеСведенияОбИсполнителе, Период, Организация, ИсполнителиБрокерские, СчетДоверительногоУправления",
		Истина, Объект.Дата, Объект.Организация, Ложь, Объект.СчетДоверительногоУправления);
			
	ДанныеПоИсполнителю = ОткрытьФормуМодально("Справочник.БанковскиеСчета.Форма.ФормаВыбораИзИсполнителей", ПараметрыФормыВыбора, ЭтаФорма);
	
	Если ТипЗнч(ДанныеПоИсполнителю) = Тип("Структура") Тогда
		Объект.Объект = ДанныеПоИсполнителю.РасчетныйСчет;
		// Банк тоже обновим
		Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПоИсполнителю.РасчетныйСчет, "Банк");
		Объект.Контрагент = ?(Объект.Контрагент = Банк, Объект.Контрагент, Банк);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьДоговорБрокерскогоОбслуживания()
	
	Если Не (ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.БрокерскиеКомпании") И ЗначениеЗаполнено(Объект.Контрагент)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// У одного брокера один действующий договор
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК Договор
	|ИЗ
	|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 						Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 					Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Брокер", 						Объект.Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Объект = Выборка.Договор;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	Если Объект.Проведен И Объект.ВидАкцепта = ПредопределенноеЗначение("Перечисление.ВидыАкцептов.МНО")
		И ТипЗнч(Объект.Объект) = Тип("ДокументСсылка.Распоряжение") Тогда
	
		ЭтаФорма.Закрыть(Новый Структура("СоздатьМНО"));
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
